//////
////////Класс ? Строка.Дополнительно перегрузить следующие операции : 
//////
////////-? удалить элемент из строки из заданной позиции(типа  set - item);
//////
////// //> ? проверка на вхождение подстроки;
//////
////// //!= ? проверка строк на неравенство; 
//////
//////// +? сложить строки
#include <iostream>
#include "String.h"

using namespace std;

int main()
{

	setlocale(0, "");
	char *a = new char[50], *b = new char[50], *c = new char[50];
	int del;
	cout << "______________________________________________________________" << endl;
	cout << "Введите строку 1: ";
	cin.getline(a, 50);

	cout << "Введите строку 2: ";
	cin.getline(b, 50);
	cout << "______________________________________________________________" << endl;
	String ob1(a, 0), ob2(b, 0), ob3;
	if (ob1 == ob2)
		cout << "Строки равны";
	else 
		cout << "Строки не равны" << endl;
	cout << "______________________________________________________________" << endl;
	cout << "проверка на подстроку" << endl<<endl;
	if (ob1 > ob2)
		cout << "подстрока есть" << endl;
	else
		cout << "подстроки нет" << endl;
	cout << "______________________________________________________________" << endl;
	int udal;
	cout << '\n';
	cout << "Номер строки откуда удаляем: ";
	cin >> udal;
	cout << "Символ: ";
	cin >> del;
	String ob4(c,del);
	if (udal == 1)
		ob4 = ob1-del;
	if (udal == 2)
		ob4 = ob2 -del;
	cout << "______________________________________________________________" << endl;
	ob3 = ob1 + ob2;
	cout << "______________________________________________________________" << endl;
	return 0;
}